[
	"When you got circumcised, did it take more than one try?",
	"Your dick's so small, you can sodomize anys.",
	"Your dick's so small, you can masturbate through the slits in a fork",
	"Your dick's so small, you rent out the Hubbell when you have to piss.",
	"Your dick's so small, bacteria laugh at it.",
	"Your dick's so small, you could screw a pasta strainer.",
	"Your dick's so small, the doctor wasn't quite sure what you were.",
	"I never knew you could have a belly button under your stomach.",
	"Your dick's so thin, I've seen paper clips wider.",
	"Your dick's so crooked, it's like a compass, it always points north.",
	"There's bread harder than your dick.",
	"Your dick's so small, you could get a B.J. from a crease in a lip.",
	"Your dick's so small, the police filed it a missing person.",
	"Your dick's so small, a cop frisks you and asks, \"Sex change?\"",
	"Your dick's so thin, you could turn it sideways and it'd disappear.",
	"Your dick's so thin, Calista Flockhart (Ally McBeal) is jealous.",
	"Your dick's so small, when you have sex, girls ask if it's in yet.",
	"Your dick's so ugly, it's like a pimple with a pulse.",
	"When you go swimming in cold water, does your dick get bigger?",
	"Your confusin an inch with a foot again.",
	"Your dick's so small, satisfying a woman for you is \"Mission: Impossible\".",
	"There's a wrinkle in your pants, you hard?",
	"How about I kick you in the nuts? That's a foot. Contrast and compare.",
	"Your dick's so small, when you were born, the doctor smacked the wrong side.",
	"Are you ever gonna get that wart lanced?",
	"What does a man with a small penis have for breakfast? (PAUSE) I dunno, what'd you have?",
	"Your dick's so thin, paper called you up and said, \"YOU BASTARD!\"",
	"Your dick's so small, it sleeps in a matchbox with a cotton swab pillow.",
	"Your dick's so small, you'll never be half the man your mother was.",
	"Your dick's so small, you could use a thimble and fishing line for a thong.",
	"Your dick's so small, I haven't laughed that hard since I saw your balls.",
	"Your dick's so small, your condoms look like the thumb of a latex glove.",
	"I bet you can make your dick disappear by breathing in and out.",
	"Your dick's so ugly it cries itself to sleep at night.",
	"Your dick's so small, you stand next to a light switch naked all day crying.",
	"You got less meat in your pants than there is in a vegetarian restaurant.",
	"After hours of going at it with a woman, she yawns and asks if you're done yet.",
	"Your dick's so small, it looks like one of the California raisins.",
	"Your dick must be tiny, I heard you had sex with a shower head.",
	"When you get hard it looks like a toothpick.",
	"Your dick's so thin, it represents Weight Watchers.",
	"Your dick's so ugly, they put in fields to scare away the crows.",
	"Your dick's so small, your girlfriend took it to court and they threw it out for lack of evidence.",
	"The only time you can give a woman orgasm is when you pull out your American Express.",
	"Your dick's so small, you think it's gonna explode when you cum.",
	"Your doctor called he said you had a small problem.",
	"You have to put the seat down to piss, right?",
	"The only thing your dick's bigger than is a grain of dust.",
	"Your dick's so small, you piss on your nuts.",
	"Your dick's so small, sperm's a tight squeeze"
]